print('Hello world')
########################## Типы данных и переменная (Data types and variable) #################################
############################# int, float, boolean, str, list, none ############################################
# #
# a = 23
# b = 1.23
# val = None
# print(type(val))
# s = 'name'
# print(s)
# print(a, b, val, s)
# print(a, '-', b, '-', val, '-', s)
# print('{} - {} - {} - {}'.format(a, b, val, s))
# print('{3} - {2} - {1} - {0}'.format(a, b, val, s))
# print(f'{a} - {b} - {val} - {s}')
# print('-----------------------------------------------------')
# list = [1, 2, 3, 4, 'list', True] ############## ТАК ДЕЛАТЬ МОЖНО, НО НЕ НУЖНО
# print(list)


############################# Ввод и вывод данных #############################################
############################# Преобразование типов ############################################

print('Введите а')
a = input()
print('Введите b')
b = input()
print(a, b)
print('{} -- {}'.fotmat(a, b))
